# TessellatedFace Class

---
Defines a planar face bounded by a polyline in 3d space. A face consists of a single connected component and can have holes.
SystemObject Autodesk.Revit.DBTessellatedFace
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class TessellatedFace : IDisposable

    Public Class TessellatedFace
    	Implements IDisposable

    public ref class TessellatedFace : IDisposable

    type TessellatedFace =
        class
            interface IDisposable
        end
The TessellatedFace type exposes the following members.
| Name| Description
---|---|---
| TessellatedFace(IListXYZ, ElementId)| Initializes a new instance of the TessellatedFace class
| TessellatedFace(IListIListXYZ, ElementId)| Initializes a new instance of the TessellatedFace class
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| MaterialId|  Material of the face.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the TessellatedFace
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetBoundaryLoops|  Get loops bounding the face.
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace